<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"21ad37ba9d277e3029e0ccb2dd7e16cbd3d54934c43d2297b84937e69fb75ff3","plan_job_ref":"Job Terraform Plan #67 at https://github.com/cal-itp/data-infra/actions/runs/14412536969","plan_out_hash":"2662d1fbc07e0ffa721206a59263921fed815e6a74c27c01b921d1edca01472f","plan_hash":"3d168949ff8e5e1bbbfb9587b8234a92de09e04338eba4272c9ec7544b32d418","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/cdn/us__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_compute_backend_bucket.calitp-staging-dbt-docs will be created
+   resource "google_compute_backend_bucket" "calitp-staging-dbt-docs" {
+       bucket_name        = "calitp-staging-dbt-docs"
+       creation_timestamp = (known after apply)
+       enable_cdn         = true
+       id                 = (known after apply)
+       name               = "calitp-staging-dbt-docs-backend-bucket"
+       project            = (known after apply)
+       self_link          = (known after apply)

+       cdn_policy {
+           cache_mode        = "CACHE_ALL_STATIC"
+           client_ttl        = 3600
+           default_ttl       = 3600
+           max_ttl           = 86400
+           negative_caching  = true
+           serve_while_stale = 86400
        }
    }

  # google_compute_global_forwarding_rule.default will be created
+   resource "google_compute_global_forwarding_rule" "default" {
+       id                    = (known after apply)
+       ip_address            = "projects/cal-itp-data-infra-staging/global/addresses/static-load-balancer-address"
+       ip_protocol           = "TCP"
+       label_fingerprint     = (known after apply)
+       load_balancing_scheme = "EXTERNAL"
+       name                  = "http-lb-forwarding-rule"
+       network               = (known after apply)
+       port_range            = "80"
+       project               = (known after apply)
+       psc_connection_id     = (known after apply)
+       psc_connection_status = (known after apply)
+       self_link             = (known after apply)
+       target                = (known after apply)
    }

  # google_compute_target_http_proxy.default will be created
+   resource "google_compute_target_http_proxy" "default" {
+       creation_timestamp = (known after apply)
+       id                 = (known after apply)
+       name               = "http-lb-proxy"
+       project            = (known after apply)
+       proxy_bind         = (known after apply)
+       proxy_id           = (known after apply)
+       self_link          = (known after apply)
+       url_map            = (known after apply)
    }

  # google_compute_url_map.default will be created
+   resource "google_compute_url_map" "default" {
+       creation_timestamp = (known after apply)
+       default_service    = (known after apply)
+       fingerprint        = (known after apply)
+       id                 = (known after apply)
+       map_id             = (known after apply)
+       name               = "http-lb"
+       project            = (known after apply)
+       self_link          = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #67](https://github.com/cal-itp/data-infra/actions/runs/14412536969)